app/controllers/chats_controller.rb

SELECT * FROM "chats" WHERE ("chats"."id" = 3)
---
  def show
    @chat = Chat.find(params[:id])

INSERT INTO "chats" ("name", "created_at", "updated_at", "message") VALUES('komagata', '2009-05-04 14:27:46', '2009-05-04 14:27:46', 'unk')
---
  def create
    @chat = Chat.create(params[:chat])